A = [0,1,1;1,0,1;2,1,1]
b=[2;2;4]
root=[1;1;1]
% b=[
%  47;
%  43;
%  43;
%  42;
% 121;
%  29;
%  49;
%  84;
%  23;
%   9]
% A = [
% 2,	 1,	 1,	7,	8,	9,	0,	8,	6,	 5;
% 4,	 3,	 4,	5,	6,	5,	4,	3,	4,	 5;
% 1,	 7,	 7,	5,	5,	4,	3,	2,	4,	 5;
% 6,	 7,	 8,	0,	6,	5,	4,	3,	3,	 0;
% 4,	78,	 7,	8,	4,	0,	5,	6,	5,	 4;
% 4,	 1,	 2,	5,	4,	1,	2,	5,	4,	 1;
% 2,	 3,	 6,	5,	5,	8,	4,	4,	0,	12;
% 5,	 5,	54,	1,	1,	2,	2,	5,	5,	 4;
% 1,	 1,	 2,	5,	5,	4,	1,	1,	2,	 1;
% 1,	 0,	 1,	1,	1,	1,	1,	1,	1,	 1]

% root=[1;1;1;1;1;1;1;1;1;1]
% A=10*randn(10)
n=length(b)
if det(A)~=0
A=[A,b]
Err1=[]
%прямой ход метода Гауса
    for i=1:(n)
        for j=(i+1):(n)
            if A(i,i)==0
                disp("0 на диагонали")
                M=0;
                index_M=0;
                for r=i+1:n
                    if abs(A(r,i))>M
                        M=abs(A(r,i));
                        index_M=r;
                    end
                end
                c=A(i,:);
                A
                A(i,:)=A(r,:);
                A(r,:)=c
            end
            m=A(j,i)/A(i,i);
            for k=1:(n+1)
                A(j,k)=A(j,k)-m*A(i,k);
            end
        end
    end
else
    disp("det=0")
end
b=A(:,n+1)
A=A(:,1:n)
%обратный ход метода Гауса
x=zeros(n,1);
x(n)=b(n)/A(n,n);
for k=n-1:-1:1
    x(k)=(b(k)-A(k,k+1:n)*x(k+1:n))/A(k,k);
end
x
Err=norm(x-root)

